## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.sre-bot will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "sre-bot"  {
      ~ id       = "a1ef8b4100ec7d8c4317411dfe52bf55fd160a150e7de9867aa46053a58565cc" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - image            = "283582579564.dkr.ecr.ca-central-1.amazonaws.com/sre-bot:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/sre-bot-app"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-sre-bot"
                        }
                    }
                  - name             = "sre-bot"
                  - secrets          = [
                      - {
                          - name      = "SLACK_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH"
                        },
                      - {
                          - name      = "APP_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                  + environment      = [
                      + {
                          + name  = "SRE_DRIVE_ID"
                          + value = "${sre_drive_id}"
                        },
                      + {
                          + name  = "SRE_INCIDENT_FOLDER"
                          + value = "${sre_incident_folder}"
                        },
                      + {
                          + name  = "INCIDENT_TEMPLATE"
                          + value = "${incident_template}"
                        },
                      + {
                          + name  = "INCIDENT_LIST"
                          + value = "${incident_list}"
                        },
                      + {
                          + name  = "INCIDENT_CHANNEL"
                          + value = "${incident_channel}"
                        },
                    ]
                  ~ secrets          = [
                        # (1 unchanged element hidden)
                        {
                            name      = "APP_TOKEN"
                            valueFrom = "${app_token}"
                        },
                      + {
                          + name      = "PICKLE_STRING"
                          + valueFrom = "${pickle_string}"
                        },
                    ]
                    # (5 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          + "incident_channel"      = (sensitive)
          + "incident_list"         = (sensitive)
          + "incident_template"     = (sensitive)
          + "pickle_string"         = (known after apply)
          + "sre_drive_id"          = (sensitive)
          + "sre_incident_folder"   = (sensitive)
            # (9 unchanged elements hidden)
        }
    }

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ca-central-1:283582579564:service/sre-bot-cluster/sre-bot-service"
        name                               = "sre-bot-service"
        tags                               = {
            "CostCentre" = "sre-bot"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:1" -> (known after apply)
        # (14 unchanged attributes hidden)



      ~ network_configuration {
          ~ assign_public_ip = true -> false
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sre-bot must be replaced
-/+ resource "aws_ecs_task_definition" "sre-bot" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "283582579564.dkr.ecr.ca-central-1.amazonaws.com/sre-bot:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/sre-bot-app"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-sre-bot"
                        }
                    }
                  - mountPoints      = []
                  - name             = "sre-bot"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "SLACK_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH"
                        },
                      - {
                          - name      = "APP_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "sre-bot-task" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.pickle_string will be created
  + resource "aws_secretsmanager_secret" "pickle_string" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "app-token-144676"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.pickle_string will be created
  + resource "aws_secretsmanager_secret_version" "pickle_string" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.pickle_string"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.slack_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

20 tests, 8 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
